In [1]:
import pandas as pd

In [2]:
data = {
    "Name": ["John", "Anna", "Peter", "Linda"],
    "Age": [28, 34, 29, 32],
    "City": ["New York", "Paris", "Berlin", "London"],
}

In [6]:
df = pd.DataFrame(data)
df

    Name  Age      City
0   John   28  New York
1   Anna   34     Paris
2  Peter   29    Berlin
3  Linda   32    London

In [7]:
df["Name"]

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [8]:
df["Name"].head(2)

0    John
1    Anna
Name: Name, dtype: object

In [9]:
import numpy as np

In [10]:
items = np.array(
    [
        " Apple",
        "banana ",
        "GRAPE",
        "cucumber",
        "Pineapple",
        " tomato ",
        "Orange",
        "Orange",
        " lemon",
        "Kiwi ",
        "mango",
        "blueberry ",
        " raspberry",
    ]
)

print(type(items))
print(type(items[0]))

<class 'numpy.ndarray'>
<class 'numpy.str_'>

In [11]:
hourly_visitors = np.array([468, 279, 73, 272, 406, 128, 302, 216, 140, 82])

print(type(hourly_visitors))
print(type(hourly_visitors[0]))

<class 'numpy.ndarray'>
<class 'numpy.int64'>

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [13]:
df.shape

(4, 3)

In [14]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

In [15]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [17]:
df.describe()

             Age
count   4.000000
mean   30.750000
std     2.753785
min    28.000000
25%    28.750000
50%    30.500000
75%    32.500000
max    34.000000

In [18]:
df.describe(include="all")

        Name        Age      City
count      4   4.000000         4
unique     4        NaN         4
top     John        NaN  New York
freq       1        NaN         1
mean     NaN  30.750000       NaN
std      NaN   2.753785       NaN
min      NaN  28.000000       NaN
25%      NaN  28.750000       NaN
50%      NaN  30.500000       NaN
75%      NaN  32.500000       NaN
max      NaN  34.000000       NaN

In [19]:
tip_df = pd.read_csv("./tips.csv")

In [20]:
tip_df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [21]:
tip_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [22]:
tip_df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [23]:
tip_df["smoker"].value_counts()

smoker
No     151
Yes     93
Name: count, dtype: int64

In [24]:
tip_df[["day", 'time', 'tip']]

      day    time   tip
0     Sun  Dinner  1.01
1     Sun  Dinner  1.66
2     Sun  Dinner  3.50
3     Sun  Dinner  3.31
4     Sun  Dinner  3.61
..    ...     ...   ...
239   Sat  Dinner  5.92
240   Sat  Dinner  2.00
241   Sat  Dinner  2.00
242   Sat  Dinner  1.75
243  Thur  Dinner  3.00

[244 rows x 3 columns]

In [25]:
tip_df['tip_per_person'] = tip_df["tip"]/tip_df["size"]

In [26]:
tip_df.head()

   total_bill   tip     sex smoker  day    time  size  tip_per_person
0       16.99  1.01  Female     No  Sun  Dinner     2        0.505000
1       10.34  1.66    Male     No  Sun  Dinner     3        0.553333
2       21.01  3.50    Male     No  Sun  Dinner     3        1.166667
3       23.68  3.31    Male     No  Sun  Dinner     2        1.655000
4       24.59  3.61  Female     No  Sun  Dinner     4        0.902500

In [27]:
tip_df["tip_percent"] = round((tip_df["tip"] / tip_df["total_bill"]) * 100, 2)

In [28]:
tip_df.head()

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
0,16.99,1.01,Female,No,Sun,Dinner,2,0.505000,5.94
1,10.34,1.66,Male,No,Sun,Dinner,3,0.553333,16.05
2,21.01,3.50,Male,No,Sun,Dinner,3,1.166667,16.66
3,23.68,3.31,Male,No,Sun,Dinner,2,1.655000,13.98
4,24.59,3.61,Female,No,Sun,Dinner,4,0.902500,14.68

In [29]:
tip_df.sort_values(by="tip_percent", ascending=False).head(5)

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
172,7.25,5.15,Male,Yes,Sun,Dinner,2,2.575,71.03
178,9.60,4.00,Female,Yes,Sun,Dinner,2,2.000,41.67
67,3.07,1.00,Female,Yes,Sat,Dinner,1,1.000,32.57
232,11.61,3.39,Male,No,Sat,Dinner,2,1.695,29.20
183,23.17,6.50,Male,Yes,Sun,Dinner,4,1.625,28.05

In [30]:
tip_df.sort_values(by="total_bill", ascending=False).head(5)

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
170,50.81,10.00,Male,Yes,Sat,Dinner,3,3.333333,19.68
212,48.33,9.00,Male,No,Sat,Dinner,4,2.250000,18.62
59,48.27,6.73,Male,No,Sat,Dinner,4,1.682500,13.94
156,48.17,5.00,Male,No,Sun,Dinner,6,0.833333,10.38
182,45.35,3.50,Male,Yes,Sun,Dinner,3,1.166667,7.72

In [31]:
tip_df[tip_df['day'] == 'Sun']

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
0,16.99,1.01,Female,No,Sun,Dinner,2,0.505000,5.94
1,10.34,1.66,Male,No,Sun,Dinner,3,0.553333,16.05
2,21.01,3.50,Male,No,Sun,Dinner,3,1.166667,16.66
3,23.68,3.31,Male,No,Sun,Dinner,2,1.655000,13.98
4,24.59,3.61,Female,No,Sun,Dinner,4,0.902500,14.68
...,...,...,...,...,...,...,...,...,...
186,20.90,3.50,Female,Yes,Sun,Dinner,3,1.166667,16.75
187,30.46,2.00,Male,Yes,Sun,Dinner,5,0.400000,6.57
188,18.15,3.50,Female,Yes,Sun,Dinner,3,1.166667,19.28
189,23.10,4.00,Male,Yes,Sun,Dinner,3,1.333333,17.32
190,15.69,1.50,Male,Yes,Sun,Dinner,2,0.750000,9.56

In [32]:
tip_df['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [36]:
only_fri = tip_df[(tip_df["tip"] > 3) & (tip_df["day"] == 'Fri')]

In [38]:
only_fri.sort_values(by="tip", ascending=False).head()

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
95,40.17,4.73,Male,Yes,Fri,Dinner,4,1.1825,11.77
93,16.32,4.30,Female,Yes,Fri,Dinner,2,2.1500,26.35
96,27.28,4.00,Male,Yes,Fri,Dinner,2,2.0000,14.66
91,22.49,3.50,Male,No,Fri,Dinner,2,1.7500,15.56
221,13.42,3.48,Female,Yes,Fri,Lunch,2,1.7400,25.93

# Slicing

In [39]:
tip_df.tail()

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
239,29.03,5.92,Male,No,Sat,Dinner,3,1.973333,20.39
240,27.18,2.00,Female,Yes,Sat,Dinner,2,1.000000,7.36
241,22.67,2.00,Male,Yes,Sat,Dinner,2,1.000000,8.82
242,17.82,1.75,Male,No,Sat,Dinner,2,0.875000,9.82
243,18.78,3.00,Female,No,Thur,Dinner,2,1.500000,15.97

In [40]:
tip_df.head()

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
0,16.99,1.01,Female,No,Sun,Dinner,2,0.505000,5.94
1,10.34,1.66,Male,No,Sun,Dinner,3,0.553333,16.05
2,21.01,3.50,Male,No,Sun,Dinner,3,1.166667,16.66
3,23.68,3.31,Male,No,Sun,Dinner,2,1.655000,13.98
4,24.59,3.61,Female,No,Sun,Dinner,4,0.902500,14.68

In [42]:
tip_df.iloc[3]
tip_df.iloc[3:5]

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
3,23.68,3.31,Male,No,Sun,Dinner,2,1.6550,13.98
4,24.59,3.61,Female,No,Sun,Dinner,4,0.9025,14.68

In [47]:
tip_df.loc[3]
tip_df.loc[3:5, ['tip', 'size']]
tip_df.loc[3:5, "tip": "size"]

    tip     sex smoker  day    time  size
3  3.31    Male     No  Sun  Dinner     2
4  3.61  Female     No  Sun  Dinner     4
5  4.71    Male     No  Sun  Dinner     4